#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# @Author  : Linfeng_Bingyi
# @Contact : linfengbingyi@qq.com
# @File    : ConstArgs.py
# @Time    : 2023/9/10 15:10

EXPENSE_CATEGORY = {
        "吃食": 0,
        "出行": 1,
        "住房": 2,
        "服饰": 3,
        "日用品": 4,
        "家居": 5,
        "医疗": 6,
        "固定消费": 7,
        "工作": 8,
        "学习教育": 9,
        "休闲娱乐": 10,
        "往来": 11,
        "金融理财": 12,
        "动植物": 13,
        "非本人相关": 14,
        "慈善捐赠": 15,
        "借贷": 16
        }
INCOME_CATEGORY = {
        "工资": 0,
        "储蓄利息": 1,
        "投资理财": 2,
        "额度券类": 3,
        "杂活收入": 4,
        "非本人相关": 5,
        "慈善捐赠": 6,
        "借贷": 7
        }
FUNDS_CATEGORY = {
        0: "微信零钱",
        1: "中国银行卡",
        2: "羊城通",
        3: "支付宝余额宝",
        4: "代管存款"
        }
